checkpoint 2026-01-18 18:20: integrated guardian shield + help button req
